src/InformationRegisters/КомментарииЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КомментарииЗаявок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстКомментария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Аннулирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАннулирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аннулировал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКомментария</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКомментариев</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИсторияИзмененияСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияИзмененияСтатусов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтарыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ITЗаявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыКомментариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКомментариев</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПричинаВозврата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлужебнаяЗаметка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Решена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеЗаявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросУточнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаУточнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеЗаявки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеСрокаРеакции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеСрокаРешения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НарушениеSLA</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетНазначения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетЗакрытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяРаботаСОборудованием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаСОборудованиемЗавершена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ITЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ITЗаявка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроблемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/УправлениеКомментариямиСервер/Ext/Module.bsl
Функция ЗаписатьКомментарий(Заявка, ТипКомментария,ТекстКомментария) Экспорт
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка для комментария.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТипКомментария) Тогда
		Сообщить("Не указан тип комментария.");
		Возврат Ложь;
	КонецЕсли;
	
	ОчищенныйТекст = СокрЛП(ТекстКомментария);
	Если ПустаяСтрока(ОчищенныйТекст) Тогда
		Сообщить("Не заполнен текст комментария.");
		Возврат Ложь;
	КонецЕсли;	
	
	Попытка   
		ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();
		
	Исключение
	    Сообщить("Не удалось определить текущего сотрудника. " + ОписаниеОшибки());
	    Возврат Ложь;
	КонецПопытки;
	
	Если ТекущийСотрудник = Неопределено Тогда
		Сообщить("Пользователь ИБ не связан с активным сотрудником.");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПользовательМожетДобавитьКомментарий(Заявка, ТекущийСотрудник, ТипКомментария) Тогда
		Сообщить("Недостаточно прав для добавления выбранного типа комментария.");
		Возврат Ложь;
	КонецЕсли;
	
	МоментКомментария = ТекущаяДатаСеанса();
	НачатьТранзакцию();	

	Попытка
		ЗаписьКомментария = РегистрыСведений.КомментарииЗаявок.СоздатьМенеджерЗаписи();
		ЗаписьКомментария.Период = МоментКомментария;
		ЗаписьКомментария.Заявка = Заявка;
		ЗаписьКомментария.Автор = ТекущийСотрудник; 
		ЗаписьКомментария.ТипКомментария = ТипКомментария;
		ЗаписьКомментария.ТекстКомментария = ОчищенныйТекст;
        ЗаписьКомментария.Записать();
		
		УведомленияОбработаны = ОбработатьУведомленияПоКомментарию(Заявка, ТипКомментария, МоментКомментария);

		Если НЕ УведомленияОбработаны Тогда
			ВызватьИсключение
				"Не удалось обработать уведомления по комментарию.";
		КонецЕсли;

		ЗафиксироватьТранзакцию();
	Исключение  
		ОтменитьТранзакцию();
	    Сообщить("Не удалось создать комментарий. " + ОписаниеОшибки());
	    Возврат Ложь;

	КонецПопытки;
	Возврат Истина;	
КонецФункции 

Функция ПолучитьДанныеЗаявкиДляКомментария(Заявка)
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Возврат Неопределено;
	КонецЕсли;		
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ITЗаявка.Заявитель КАК Заявитель,
		|	ITЗаявка.Исполнитель КАК Исполнитель,
		|	ITЗаявка.ТекущийСтатус КАК ТекущийСтатус
		|ИЗ
		|	Документ.ITЗаявка КАК ITЗаявка
		|ГДЕ
		|	ITЗаявка.Ссылка = &Ссылка
		|	И ITЗаявка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЗаявки = Новый Структура;
	ДанныеЗаявки.Вставить("Заявитель", Выборка.Заявитель); 
	ДанныеЗаявки.Вставить("Исполнитель", Выборка.Исполнитель);
	ДанныеЗаявки.Вставить("ТекущийСтатус", Выборка.ТекущийСтатус);
	
	Возврат ДанныеЗаявки;
КонецФункции   

Функция ПользовательМожетДобавитьКомментарий(Заявка, ТекущийСотрудник, ТипКомментария)
	Если НЕ ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		Сообщить("Не указан сотрудник.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТипКомментария) Тогда
		Сообщить("Не указан тип комментария.");
		Возврат Ложь;
	КонецЕсли;      
	
	ДанныеЗаявки = ПолучитьДанныеЗаявкиДляКомментария(Заявка);
	Если ДанныеЗаявки = Неопределено Тогда
		Сообщить("Заявка не найдена.");
		Возврат Ложь;
	КонецЕсли; 
	
	ЭтоАдминистратор = РольДоступна("АдминистраторСистемы");
	ЭтоРуководитель = РольДоступна("РуководительITОтдела");
	ЭтоСотрудник = РольДоступна("ПользовательСотрудник");
	ЭтоИсполнитель = РольДоступна("ИсполнительЗаявок");  
	
	ЭтоЗаявитель = ЭтоСотрудник И ТекущийСотрудник = ДанныеЗаявки.Заявитель;
	ЭтоНазначенныйИсполнитель = ЭтоИсполнитель И ТекущийСотрудник = ДанныеЗаявки.Исполнитель;
	
	Если ТипКомментария = Перечисления.ТипыКомментариев.ЗапросУточнения 
		И (ЭтоАдминистратор ИЛИ ЭтоНазначенныйИсполнитель) 
		И ДанныеЗаявки.ТекущийСтатус = Перечисления.СтатусыЗаявок.ВРаботе Тогда
		
		Возврат Истина;	
	КонецЕсли;  
	
	Если ТипКомментария = Перечисления.ТипыКомментариев.Комментарий 
		И (ЭтоАдминистратор ИЛИ ЭтоНазначенныйИсполнитель ИЛИ ЭтоРуководитель ИЛИ ЭтоЗаявитель) Тогда
		
		Возврат Истина;	
	КонецЕсли;  
	
	Если ТипКомментария = Перечисления.ТипыКомментариев.ОтветСотрудника 
		И ЭтоЗаявитель  
		И ДанныеЗаявки.ТекущийСтатус = Перечисления.СтатусыЗаявок.ОжидаетУточнения Тогда
		
		Возврат Истина;	
	КонецЕсли;  
	
	Если ТипКомментария = Перечисления.ТипыКомментариев.ПричинаВозврата 
		И (ЭтоАдминистратор ИЛИ ЭтоРуководитель)
		И ДанныеЗаявки.ТекущийСтатус = Перечисления.СтатусыЗаявок.Решена Тогда
		
		Возврат Истина;	
	КонецЕсли;  
	
	Если ТипКомментария = Перечисления.ТипыКомментариев.СлужебнаяЗаметка 
		И (ЭтоАдминистратор ИЛИ ЭтоРуководитель ИЛИ ЭтоНазначенныйИсполнитель) Тогда
		
		Возврат Истина;	
	КонецЕсли; 
	
	
	Возврат Ложь;
КонецФункции

Функция ОбработатьУведомленияПоКомментарию(Заявка, ТипКомментария, МоментКомментария) 
	Если ТипКомментария <> Перечисления.ТипыКомментариев.ОтветСотрудника Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДанныеЗаявки = ПолучитьДанныеЗаявкиДляКомментария(Заявка);
	Если ДанныеЗаявки = Неопределено Тогда
		Сообщить("Не удалось получить данные заявки.");
		Возврат Ложь;  
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаявки.Исполнитель) Тогда
		Сообщить("Не удалось получить данные об исполнителе заявки.");
		Возврат Ложь;  
	КонецЕсли;
	
	УведомлениеОбработано = УправлениеУведомлениямиСервер.ОтметитьУведомленияОбработанными(Заявка, Перечисления.ТипыУведомлений.ЗапросУточнения, МоментКомментария);
	Если НЕ УведомлениеОбработано Тогда  
		Сообщить("Не удалось закрыть уведомление запроса уточнения.");
		Возврат Ложь;	
	КонецЕсли;

	ТекстУведомления = "По заявке " + Строка(Заявка) + " получен ответ на запрос уточнения.";  
	УведомлениеЗаписано = 
		УправлениеУведомлениямиСервер.ЗаписатьУведомление(
			ДанныеЗаявки.Исполнитель, Заявка, Перечисления.ТипыУведомлений.ОтветНаУточнение, ТекстУведомления, МоментКомментария);
			
	Если НЕ УведомлениеЗаписано Тогда
		Сообщить("Не удалось создать уведомление об ответе на уточнение.");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции        

Функция АннулироватьКомментарий(Период, Заявка, Автор, ТипКомментария) Экспорт    
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка для комментария.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Сообщить("Не указан период комментария.");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Сообщить("Не указан автор комментария.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТипКомментария) Тогда
		Сообщить("Не указан тип комментария.");
		Возврат Ложь;
	КонецЕсли;  
	
	Попытка
		ТекущийСотрудник = УправлениеПользователямиСервер.ПолучитьТекущегоСотрудника();
	Исключение
		Сообщить("Не удалось определить текущего сотрудника. " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	Если ТекущийСотрудник = Неопределено Тогда
		Сообщить("Пользователь ИБ не связан с активным сотрудником.");
		Возврат Ложь;
	КонецЕсли;   
	
	Попытка
		ЗаписьКомментария = РегистрыСведений.КомментарииЗаявок.СоздатьМенеджерЗаписи();
		ЗаписьКомментария.Автор = Автор;
		ЗаписьКомментария.Период = Период;   
		ЗаписьКомментария.Заявка = Заявка;
		ЗаписьКомментария.ТипКомментария = ТипКомментария; 
		ЗаписьКомментария.Прочитать();
		
	Исключение
	    Сообщить("Не удалось получить комментарий. " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
		
	Если НЕ ЗаписьКомментария.Выбран() Тогда
		Сообщить("Не удалось найти комментарий.");
		Возврат Ложь;
	КонецЕсли; 

	ЭтоАдминистратор = РольДоступна("АдминистраторСистемы");
	ЭтоАвтор = ЗаписьКомментария.Автор = ТекущийСотрудник; 
	
	Если НЕ ЭтоАдминистратор И НЕ ЭтоАвтор Тогда
		Сообщить("Недостаточно прав для удаления комментария.");
		Возврат Ложь;
	КонецЕсли; 
	
	Если ЗаписьКомментария.Аннулирован = Истина Тогда
		Возврат Истина;
	КонецЕсли;  
	
	Попытка
		КомментарийИспользован =
			КомментарийИспользованДляПерехода(
				ЗаписьКомментария.Период,
				ЗаписьКомментария.Заявка,
				ЗаписьКомментария.ТипКомментария);
				
	Исключение
		Сообщить("Не удалось проверить использование комментария. " + ОписаниеОшибки());
		Возврат Ложь;  
		
	КонецПопытки;

	Если КомментарийИспользован Тогда
		Сообщить("Комментарий нельзя удалить, поскольку он уже использован " + "для изменения статуса заявки.");	
		Возврат Ложь;
	КонецЕсли;
	
	МоментАннулирования = ТекущаяДатаСеанса(); 
	
	НачатьТранзакцию();
	
		Попытка
		ЗаписьКомментария.Аннулирован = Истина;
		ЗаписьКомментария.ДатаАннулирования = МоментАннулирования;
		ЗаписьКомментария.Аннулировал = ТекущийСотрудник;
		ЗаписьКомментария.Записать();
		
		Если ЗаписьКомментария.ТипКомментария = Перечисления.ТипыКомментариев.ОтветСотрудника Тогда
			УведомленияОбработаны = УправлениеУведомлениямиСервер
				.ОбработатьУведомленияПриАннулированииОтвета(Заявка, Период, МоментАннулирования);
			
		    Если НЕ УведомленияОбработаны Тогда
				ВызватьИсключение
					"Не удалось изменить связанные уведомления.";
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение    
		ОтменитьТранзакцию();
	 	Сообщить("Не удалось удалить комментарий. " + ОписаниеОшибки()); 
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции                   

Функция ЕстьАктуальныйКомментарийДляПерехода(Заявка, СтарыйСтатус, ТипКомментария) Экспорт   
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СтарыйСтатус) Тогда
		Сообщить("Не указан предыдущий статус.");
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипКомментария) Тогда
		Сообщить("Не указан тип комментария.");
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсторияИзмененияСтатусов.Период КАК МоментВходаВСтатус
		|ИЗ
		|	РегистрСведений.ИсторияИзмененияСтатусов КАК ИсторияИзмененияСтатусов
		|ГДЕ
		|	ИсторияИзмененияСтатусов.Заявка = &Заявка
		|	И ИсторияИзмененияСтатусов.НовыйСтатус = &СтарыйСтатус
		|
		|УПОРЯДОЧИТЬ ПО
		|	МоментВходаВСтатус УБЫВ";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("СтарыйСтатус", СтарыйСтатус);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МоментВходаВСтатус = Выборка.МоментВходаВСтатус;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КомментарииЗаявок.Период КАК Период
		|ИЗ
		|	РегистрСведений.КомментарииЗаявок КАК КомментарииЗаявок
		|ГДЕ
		|	КомментарииЗаявок.Заявка = &Заявка
		|	И КомментарииЗаявок.ТипКомментария = &ТипКомментария
		|	И КомментарииЗаявок.Аннулирован = ЛОЖЬ
		|	И КомментарииЗаявок.Период >= &МоментВходаВСтатус
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("МоментВходаВСтатус", МоментВходаВСтатус);
	Запрос.УстановитьПараметр("ТипКомментария", ТипКомментария);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
    Возврат Истина;
КонецФункции     

Функция КомментарийИспользованДляПерехода(ПериодКомментария, Заявка, ТипКомментария) 
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Сообщить("Не указана заявка.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ПериодКомментария) Тогда
		Сообщить("Не указан период комментария.");
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТипКомментария) Тогда
		Сообщить("Не указан тип комментария.");
		Возврат Ложь;
	КонецЕсли;
	
	Если  ТипКомментария = Перечисления.ТипыКомментариев.ЗапросУточнения Тогда	
		ОжидаемыйСтарыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе;   
		ОжидаемыйНовыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетУточнения;
			
	ИначеЕсли  ТипКомментария = Перечисления.ТипыКомментариев.ОтветСотрудника Тогда	
		ОжидаемыйСтарыйСтатус = Перечисления.СтатусыЗаявок.ОжидаетУточнения;   
		ОжидаемыйНовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе;
		
	ИначеЕсли  ТипКомментария = Перечисления.ТипыКомментариев.ПричинаВозврата Тогда	
		ОжидаемыйСтарыйСтатус = Перечисления.СтатусыЗаявок.Решена;   
		ОжидаемыйНовыйСтатус = Перечисления.СтатусыЗаявок.ВРаботе;   
		
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсторияИзмененияСтатусов.СтарыйСтатус КАК СтарыйСтатус,
	|	ИсторияИзмененияСтатусов.НовыйСтатус КАК НовыйСтатус
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияСтатусов КАК ИсторияИзмененияСтатусов
	|ГДЕ
	|	ИсторияИзмененияСтатусов.Заявка = &Заявка
	|	И ИсторияИзмененияСтатусов.Период >= &ПериодКомментария
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсторияИзмененияСтатусов.Период ВОЗР";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ПериодКомментария", ПериодКомментария);
	
	Выборка = Запрос.Выполнить().Выбрать();
    Если НЕ Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;  
	
	Возврат Выборка.СтарыйСтатус = ОжидаемыйСтарыйСтатус И Выборка.НовыйСтатус = ОжидаемыйНовыйСтатус;
КонецФункции    

Функция ПолучитьДоступныеТипыКомментариев(Заявка) Экспорт

	ДоступныеТипы = Новый СписокЗначений;

	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		Возврат ДоступныеТипы;
	КонецЕсли;

	Попытка
		ТекущийСотрудник =
			УправлениеПользователямиСервер
				.ПолучитьТекущегоСотрудника();
	Исключение
		Возврат ДоступныеТипы;
	КонецПопытки;

	Если НЕ ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		Возврат ДоступныеТипы;
	КонецЕсли;

	ТипыДляПроверки = Новый Массив;
	ТипыДляПроверки.Добавить(Перечисления.ТипыКомментариев.Комментарий);
	ТипыДляПроверки.Добавить(Перечисления.ТипыКомментариев.ЗапросУточнения);
	ТипыДляПроверки.Добавить(Перечисления.ТипыКомментариев.ОтветСотрудника);
	ТипыДляПроверки.Добавить(Перечисления.ТипыКомментариев.ПричинаВозврата);
	ТипыДляПроверки.Добавить(Перечисления.ТипыКомментариев.СлужебнаяЗаметка);

	Для Каждого ТипКомментария Из ТипыДляПроверки Цикл
		Если ПользовательМожетДобавитьКомментарий(Заявка, ТекущийСотрудник, ТипКомментария) Тогда
			ДоступныеТипы.Добавить(ТипКомментария);
		КонецЕсли;
	КонецЦикла;

	Возврат ДоступныеТипы;

КонецФункции
